Tutorials-4.1/superSonicCone/laminar/0/wedgeAndSlip
front
{
    type    wedge;
}

back
{
    type    wedge;
}

defaultFaces
{
    type    slip;
}

